---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallBaseOffset
source: html/3c04b790-a498-5342-eb88-7cdfa7e315cb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallBaseOffset Property

"Base Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId WallBaseOffset { get; }
```